SaitovSP/src/Catalogs/СкидочныеКарты/СкидочныеКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СкидочныеКарты</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КартуВыдал</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКарты</name>
    <type>
      <types>CatalogRef.ТипыКарт</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

SaitovSP/src/CommonModules/ДанныеКлиентаСервер/Module.bsl
Функция ПолучитьТипИРазмерСкидки(Ссылка)
	
	СтруктураСкидочнойКарты = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СкидочныеКарты.ТипКарты.Ссылка КАК ТипКартыСсылка,
		|	СкидочныеКарты.Размер КАК Размер,
		|	СкидочныеКарты.ТипКарты.ИмяПредопределенныхДанных КАК ТипКартыИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.СкидочныеКарты КАК СкидочныеКарты
		|ГДЕ
		|	СкидочныеКарты.Клиент.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураСкидочнойКарты.Вставить("ТипСкидки", ВыборкаДетальныеЗаписи.ТипКартыИмяПредопределенныхДанных);
		СтруктураСкидочнойКарты.Вставить("РазмерСкидки", ВыборкаДетальныеЗаписи.Размер);
	КонецЦикла;
	
	Возврат СтруктураСкидочнойКарты;
	
КонецФункции
